lkolbly/cmsis-svd/data/Holtek/HT32F12364.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- Copyright (C) 2010 ARM Limited. All rights reserved.                         -->
<!--                                                                              -->
<!-- ARM Limited (ARM) is supplying this SVD description for use with Cortex-M3   -->
<!-- processor based microcontrollers.  This file and or content can be freely    -->
<!-- distributed within development tools that are supporting such ARM based      -->
<!-- processors.                                                                  -->
<!--                                                                              -->
<!-- THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED  -->
<!-- OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF           -->
<!-- MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. -->
<!-- ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR   -->
<!-- CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.                            -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_0.xsd">
  <name>HT32F12364</name>
  <version>1.1</version>
  <description>This is the description for the Holtek HT32F12364</description>
  <addressUnitBits>8</addressUnitBits>
  <!--Bits-->
  <width>32</width>
  <!--Bits-->
  <size>32</size>
  <!--Bits-->
  <access>read-write</access>
  <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <cpu>
    <name>CM3</name>
    <revision>r2p0</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <peripherals>
    <!--NVIC-->
    <peripheral>
      <name>NVIC</name>
      <version>1.0</version>
      <description>NVIC</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000E000</baseAddress>
      <size>32</size>
      <!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <!--Bytes-->
        <usage>registers</usage>
        <!--registers/buffer/reserved-->
      </addressBlock>
      <registers>
        <!--ICTR-->
        <register>
          <name>ICTR</name>
          <displayName>ICTR</displayName>
          <description>ICTR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>INTLINESNUM</name>
              <description>INTLINESNUM</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ACTLR-->
        <register>
          <name>ACTLR</name>
          <displayName>ACTLR</displayName>
          <description>ACTLR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DISMCYCINT</name>
              <description>DISMCYCINT</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DISDEFWBUF</name>
              <description>DISDEFWBUF</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DISFOLD</name>
              <description>DISFOLD</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ISER0-->
        <register>
          <name>ISER0</name>
          <displayName>ISER0</displayName>
          <description>ISER0</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>SETENA0</name>
              <description>SETENA0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA1</name>
              <description>SETENA1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA2</name>
              <description>SETENA2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA3</name>
              <description>SETENA3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA4</name>
              <description>SETENA4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA5</name>
              <description>SETENA5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA6</name>
              <description>SETENA6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA7</name>
              <description>SETENA7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA8</name>
              <description>SETENA8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA9</name>
              <description>SETENA9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA10</name>
              <description>SETENA10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA11</name>
              <description>SETENA11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA12</name>
              <description>SETENA12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA13</name>
              <description>SETENA13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA14</name>
              <description>SETENA14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA15</name>
              <description>SETENA15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA16</name>
              <description>SETENA16</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA17</name>
              <description>SETENA17</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA18</name>
              <description>SETENA18</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA19</name>
              <description>SETENA19</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA20</name>
              <description>SETENA20</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA21</name>
              <description>SETENA21</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA22</name>
              <description>SETENA22</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA23</name>
              <description>SETENA23</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA24</name>
              <description>SETENA24</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA25</name>
              <description>SETENA25</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA26</name>
              <description>SETENA26</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA27</name>
              <description>SETENA27</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA28</name>
              <description>SETENA28</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA29</name>
              <description>SETENA29</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA30</name>
              <description>SETENA30</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA31</name>
              <description>SETENA31</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ISER1-->
        <register>
          <name>ISER1</name>
          <displayName>ISER1</displayName>
          <description>ISER1</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>SETENA32</name>
              <description>SETENA32</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA33</name>
              <description>SETENA33</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA34</name>
              <description>SETENA34</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA35</name>
              <description>SETENA35</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA36</name>
              <description>SETENA36</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA37</name>
              <description>SETENA37</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA38</name>
              <description>SETENA38</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA39</name>
              <description>SETENA39</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA40</name>
              <description>SETENA40</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA41</name>
              <description>SETENA41</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA42</name>
              <description>SETENA42</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA43</name>
              <description>SETENA43</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA44</name>
              <description>SETENA44</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA45</name>
              <description>SETENA45</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA46</name>
              <description>SETENA46</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA47</name>
              <description>SETENA47</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA48</name>
              <description>SETENA48</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA49</name>
              <description>SETENA49</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA50</name>
              <description>SETENA50</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA51</name>
              <description>SETENA51</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA52</name>
              <description>SETENA52</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA53</name>
              <description>SETENA53</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA54</name>
              <description>SETENA54</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA55</name>
              <description>SETENA55</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA56</name>
              <description>SETENA56</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA57</name>
              <description>SETENA57</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA58</name>
              <description>SETENA58</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA59</name>
              <description>SETENA59</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA60</name>
              <description>SETENA60</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA61</name>
              <description>SETENA61</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA62</name>
              <description>SETENA62</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SETENA63</name>
              <description>SETENA63</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
