lkolbly/cmsis-svd/data/Holtek/HT32F12364.svd
        <!--ADC_STR3-->
        <register>
          <name>ADC_STR3</name>
          <displayName>ADC_STR3</displayName>
          <description>ADC_STR3</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADST3</name>
              <description>ADST3</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_STR4-->
        <register>
          <name>ADC_STR4</name>
          <displayName>ADC_STR4</displayName>
          <description>ADC_STR4</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADST4</name>
              <description>ADST4</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_STR5-->
        <register>
          <name>ADC_STR5</name>
          <displayName>ADC_STR5</displayName>
          <description>ADC_STR5</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADST5</name>
              <description>ADST5</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_STR6-->
        <register>
          <name>ADC_STR6</name>
          <displayName>ADC_STR6</displayName>
          <description>ADC_STR6</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADST6</name>
              <description>ADST6</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_STR7-->
        <register>
          <name>ADC_STR7</name>
          <displayName>ADC_STR7</displayName>
          <description>ADC_STR7</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADST7</name>
              <description>ADST7</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_STR8-->
        <register>
          <name>ADC_STR8</name>
          <displayName>ADC_STR8</displayName>
          <description>ADC_STR8</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADST8</name>
              <description>ADST8</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_STR9-->
        <register>
          <name>ADC_STR9</name>
          <displayName>ADC_STR9</displayName>
          <description>ADC_STR9</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADST9</name>
              <description>ADST9</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_STR10-->
        <register>
          <name>ADC_STR10</name>
          <displayName>ADC_STR10</displayName>
          <description>ADC_STR10</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADST10</name>
              <description>ADST10</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_STR11-->
        <register>
          <name>ADC_STR11</name>
          <displayName>ADC_STR11</displayName>
          <description>ADC_STR11</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADST11</name>
              <description>ADST11</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
