lkolbly/cmsis-svd/data/Holtek/HT32F12364.svd
        <!--MCTM_REPR-->
        <register>
          <name>MCTM_REPR</name>
          <displayName>MCTM_REPR</displayName>
          <description>MCTM_REPR</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>REPV</name>
              <description>REPV</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--MCTM_CH0CCR-->
        <register>
          <name>MCTM_CH0CCR</name>
          <displayName>MCTM_CH0CCR</displayName>
          <description>MCTM_CH0CCR</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH0CCV</name>
              <description>CH0CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--MCTM_CH1CCR-->
        <register>
          <name>MCTM_CH1CCR</name>
          <displayName>MCTM_CH1CCR</displayName>
          <description>MCTM_CH1CCR</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH1CCV</name>
              <description>CH1CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--MCTM_CH2CCR-->
        <register>
          <name>MCTM_CH2CCR</name>
          <displayName>MCTM_CH2CCR</displayName>
          <description>MCTM_CH2CCR</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH2CCV</name>
              <description>CH2CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--MCTM_CH3CCR-->
        <register>
          <name>MCTM_CH3CCR</name>
          <displayName>MCTM_CH3CCR</displayName>
          <description>MCTM_CH3CCR</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH3CCV</name>
              <description>CH3CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--MCTM_CH0ACR-->
        <register>
          <name>MCTM_CH0ACR</name>
          <displayName>MCTM_CH0ACR</displayName>
          <description>MCTM_CH0ACR</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH0ACV</name>
              <description>CH0ACV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--MCTM_CH1ACR-->
        <register>
          <name>MCTM_CH1ACR</name>
          <displayName>MCTM_CH1ACR</displayName>
          <description>MCTM_CH1ACR</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH1ACV</name>
              <description>CH1ACV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--MCTM_CH2ACR-->
        <register>
          <name>MCTM_CH2ACR</name>
          <displayName>MCTM_CH2ACR</displayName>
          <description>MCTM_CH2ACR</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH2ACV</name>
              <description>CH2ACV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--MCTM_CH3ACR-->
        <register>
          <name>MCTM_CH3ACR</name>
          <displayName>MCTM_CH3ACR</displayName>
          <description>MCTM_CH3ACR</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH3ACV</name>
              <description>CH3ACV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
