lkolbly/cmsis-svd/data/Holtek/HT32F12364.svd
      </registers>
    </peripheral>
    <!--WDT-->
    <peripheral>
      <name>WDT</name>
      <version>1.1</version>
      <description>WDT</description>
      <groupName>WDT</groupName>
      <baseAddress>0x40068000</baseAddress>
      <size>32</size>
      <!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <!--Bytes-->
        <usage>registers</usage>
        <!--registers/buffer/reserved-->
      </addressBlock>
      <interrupt>
        <name>WDT</name>
        <value>3</value>
      </interrupt>
      <registers>
        <!--WDT_CR-->
        <register>
          <name>WDT_CR</name>
          <displayName>WDT_CR</displayName>
          <description>WDT_CR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>WDTRS</name>
              <description>WDTRS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RSKEY</name>
              <description>RSKEY</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--WDT_MR0-->
        <register>
          <name>WDT_MR0</name>
          <displayName>WDT_MR0</displayName>
          <description>WDT_MR0</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>WDTV</name>
              <description>WDTV</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>WDTFIEN</name>
              <description>WDTFIEN</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>WDTRSTEN</name>
              <description>WDTRSTEN</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>WDTSHLT</name>
              <description>WDTSHLT</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>WDTEN</name>
              <description>WDTEN</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--WDT_MR1-->
        <register>
          <name>WDT_MR1</name>
          <displayName>WDT_MR1</displayName>
          <description>WDT_MR1</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>WDTD</name>
              <description>WDTD</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>WPSC</name>
              <description>WPSC</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--WDT_SR-->
        <register>
          <name>WDT_SR</name>
          <displayName>WDT_SR</displayName>
          <description>WDT_SR</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>WDTUF</name>
              <description>WDTUF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>WDTERR</name>
              <description>WDTERR</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--WDT_PR-->
        <register>
          <name>WDT_PR</name>
          <displayName>WDT_PR</displayName>
          <description>WDT_PR</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PROTECT</name>
              <description>PROTECT</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
