lkolbly/cmsis-svd/data/Holtek/HT32F12364.svd
        <!--USART0_IrDACR-->
        <register>
          <name>USART0_IrDACR</name>
          <displayName>USART0_IrDACR</displayName>
          <description>USART0_IrDACR</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>IrDAEN</name>
              <description>IrDAEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>IrDALP</name>
              <description>IrDALP</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>TXSEL</name>
              <description>TXSEL</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>LB</name>
              <description>LB</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>TXINV</name>
              <description>TXINV</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RXINV</name>
              <description>RXINV</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>IrDAPSC</name>
              <description>IrDAPSC</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--USART0_RS485CR-->
        <register>
          <name>USART0_RS485CR</name>
          <displayName>USART0_RS485CR</displayName>
          <description>USART0_RS485CR</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TXENP</name>
              <description>TXENP</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RSNMM</name>
              <description>RSNMM</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RSAAD</name>
              <description>RSAAD</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADDMATCH</name>
              <description>ADDMATCH</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--USART0_SYNCR-->
        <register>
          <name>USART0_SYNCR</name>
          <displayName>USART0_SYNCR</displayName>
          <description>USART0_SYNCR</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CLKEN</name>
              <description>CLKEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CPS</name>
              <description>CPS</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CPO</name>
              <description>CPO</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--USART0_FSR-->
        <register>
          <name>USART0_FSR</name>
          <displayName>USART0_FSR</displayName>
          <description>USART0_FSR</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TXFS</name>
              <description>TXFS</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RXFS</name>
              <description>RXFS</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--USART0_DLR-->
        <register>
          <name>USART0_DLR</name>
          <displayName>USART0_DLR</displayName>
          <description>USART0_DLR</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>BRD</name>
              <description>BRD</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--USART0_DEGTSTR-->
        <register>
          <name>USART0_DEGTSTR</name>
          <displayName>USART0_DEGTSTR</displayName>
          <description>USART0_DEGTSTR</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>LBM</name>
              <description>LBM</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
