lkolbly/cmsis-svd/data/Holtek/HT32F12364.svd
      </registers>
    </peripheral>
    <!--EBI-->
    <peripheral>
      <name>EBI</name>
      <version>1.1</version>
      <description>EBI</description>
      <groupName>EBI</groupName>
      <baseAddress>0x40098000</baseAddress>
      <size>32</size>
      <!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <!--Bytes-->
        <usage>registers</usage>
        <!--registers/buffer/reserved-->
      </addressBlock>
      <interrupt>
        <name>EBI</name>
        <value>68</value>
      </interrupt>
      <registers>
        <!--EBI_CR-->
        <register>
          <name>EBI_CR</name>
          <displayName>EBI_CR</displayName>
          <description>EBI_CR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>MODE0</name>
              <description>MODE0</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>MODE1</name>
              <description>MODE1</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>MODE2</name>
              <description>MODE2</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>MODE3</name>
              <description>MODE3</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>BANKEN0</name>
              <description>BANKEN0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>BANKEN1</name>
              <description>BANKEN1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>BANKEN2</name>
              <description>BANKEN2</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>BANKEN3</name>
              <description>BANKEN3</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>NOIDLE0</name>
              <description>NOIDLE0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>NOIDLE1</name>
              <description>NOIDLE1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>NOIDLE2</name>
              <description>NOIDLE2</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>NOIDLE3</name>
              <description>NOIDLE3</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ARDYEN0</name>
              <description>ARDYEN0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ARDYTDIS0</name>
              <description>ARDYTDIS0</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ARDYEN1</name>
              <description>ARDYEN1</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ARDYTDIS1</name>
              <description>ARDYTDIS1</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ARDYEN2</name>
              <description>ARDYEN2</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ARDYTDIS2</name>
              <description>ARDYTDIS2</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ARDYEN3</name>
              <description>ARDYEN3</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ARDYTDIS3</name>
              <description>ARDYTDIS3</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>BLEN0</name>
              <description>BLEN0</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>BLEN1</name>
              <description>BLEN1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>BLEN2</name>
              <description>BLEN2</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>BLEN3</name>
              <description>BLEN3</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>IDLET</name>
              <description>IDLET</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EBI_PCR-->
        <register>
          <name>EBI_PCR</name>
          <displayName>EBI_PCR</displayName>
          <description>EBI_PCR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PAGELEN</name>
              <description>PAGELEN</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>INCHIT</name>
              <description>INCHIT</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RDPG</name>
              <description>RDPG</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PAGEOPEN</name>
              <description>PAGEOPEN</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
